[X2ExperienceConfig]
PsiRankNames[8]="Master"
PsiShortNames[8]="Mstr."

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strNeedsSoldierClass="CANNOT EQUIP"
m_strUnavailableToClass="UNAVAILABLE"

[DepthPerceptionPCS X2EquipmentTemplate]
FriendlyName="PCS: Depth Perception"
FriendlyNamePlural="PCS: Depth Perception"
BriefSummary="This cybernetic implant grants <Ability:DP_AIM_BONUS> aim and reduces enemies' dodge by <Ability:DP_ANTIDODGE_BONUS> when you are at a higher elevation than your target."

[HyperReactivePupilsPCS X2EquipmentTemplate]
FriendlyName="PCS: Hyper-Reactive Pupils"
FriendlyNamePlural="PCS: Hyper-Reactive Pupils"
BriefSummary="This implant confers +<Ability:HYPERREACTIVE_PUPILS_AIM_BONUS> aim for your next shot with your primary weapon after a shot misses."

; LWOTC Needs Translation
[CombatAwarenessPCS X2EquipmentTemplate]
FriendlyName="PCS: Unwavering Stance"
FriendlyNamePlural="PCS: Unwavering Stance"
BriefSummary="Grants Combat Awareness and Dedicated Suppression: You have <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor when on overwatch or suppressing, and taking damage does not clear suppression."
; End Translation

[CombatRushPCS X2EquipmentTemplate]
FriendlyName="PCS: Combat Rush"
FriendlyNamePlural="PCS: Combat Rush"
BriefSummary="When you kill an enemy, allies within <Ability:COMBAT_RUSH_RADIUS> tiles receive +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility for <Ability:COMBAT_RUSH_DURATION> turns. <Ability:COMBAT_RUSH_COOLDOWN> turn cooldown."

[DamageControlPCS X2EquipmentTemplate]
FriendlyName="PCS: Damage Control"
FriendlyNamePlural="PCS: Damage Control"
BriefSummary="The implant hardens your armor against enemy fire and grants <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor for <Ability:DAMAGE_CONTROL_DURATION> turn(s) after you take damage."

[AbsorptionFieldsPCS X2EquipmentTemplate]
FriendlyName="PCS: Impact Fields"
FriendlyNamePlural="PCS: Impact Fields"
BriefSummary="This shield projector implant may be activated as an action to reduce incoming damage by 33% for <Ability:ABSORPTION_FIELDS_DURATION> turns. <Ability:ABSORPTION_FIELDS_COOLDOWN> turn cooldown."

[BodyShieldPCS X2EquipmentTemplate]
FriendlyName="PCS: Body Shield"
FriendlyNamePlural="PCS: Body Shield"
BriefSummary="Target an enemy as a free action to confer it -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against you for <Ability:BODY_SHIELD_DURATION> turns. <Ability:BODY_SHIELD_COOLDOWN> turn cooldown."

; LWOTC Needs Translation
[EmergencyLifeSupportPCS X2EquipmentTemplate]
FriendlyName="PCS: Emergency Life Support"
FriendlyNamePlural="PCS: Emergency Life Support"
BriefSummary="This implant drastically increases the threshold of overkill damage needed to bypass bleedout, making it less likely that your soldier dies when fatally shot. Bleedout timer is extended by <Ability:EMERGENCY_LIFE_SUPPORT_BONUS_BLEEDINGOUT_TURNS> turns."
; End Translation

[IronSkinPCS X2EquipmentTemplate]
FriendlyName="PCS: Iron Skin"
FriendlyNamePlural="PCS: Iron Skin"
BriefSummary="Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>."

[SmartMacrophagesPCS X2EquipmentTemplate]
FriendlyName="PCS: Smart Macrophages"
FriendlyNamePlural="PCS: Smart Macrophages"
BriefSummary="Reduces wound recovery time and grants immunity to acid and poison."

[CenterMass X2AbilityTemplate]
; A special 'е' character is used for the second 'e' to prevent the
; perk name appearing centered. Thanks to bountygiver for the suggestion.
LocFriendlyName="Centеr Mass"
LocFlyOverText="Centеr Mass"
LocLongDescription="You do one additional point of base damage when using guns."
LocHelpText="You do one additional point of base damage when using guns."
LocPromotionPopupText="<Bullet/> You do one additional point of base damage with your primary weapon, pistols or a sawed-off shotgun."

[Lethal X2AbilityTemplate]
LocFriendlyName="Lethal"
LocFlyOverText="Lethal"
; LWOTC Needs Translation
LocLongDescription="You do <Ability:LETHAL_DAMAGE_LW/> additional points of base damage and <Ability:LETHAL_CRIT_DAMAGE_LW/> additional point(s) of bonus critical damage with your primary weapon."
LocHelpText="You do <Ability:LETHAL_DAMAGE_LW/> additional points of base damage and <Ability:LETHAL_CRIT_DAMAGE_LW/> additional point(s) of bonus critical damage with your primary weapon."
LocPromotionPopupText="<Bullet/> You do <Ability:LETHAL_DAMAGE_LW/> additional points of base damage and <Ability:LETHAL_CRIT_DAMAGE_LW/> additional point(s) of bonus critical damage with your primary weapon."
; End Translation

[HitandSlither X2AbilityTemplate]
LocFriendlyName="Hit and Slither"
LocFlyOverText="Hit and Slither"
LocLongDescription="Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon. "
LocHelpText="Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocPromotionPopupText="<Bullet/> Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon.<br/>

[HitandRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocFlyOverText="Hit and Run"
; LWOTC Needs Translation 
LocLongDescription="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon. Cannot trigger on the same turn as Close Encounters. "
; End Translation 
LocHelpText="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocPromotionPopupText="<Bullet/> Cannot be used on the same turn as Run and Gun.<br/><Bullet/> Bonus full actions from Serial and Death from Above will be awarded first."

[CloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
; LWOTC Needs Translation (3)
LocLongDescription="Fire a free reaction shot with your <Ability:BOUND_WEAPON_NAME/> at any visible enemy within four tiles who moves or fires."
LocHelpText="Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
; End Translation (3)
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[CloseCombatSpecialistAttack X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
; LWOTC Needs Translation (2)
LocLongDescription="During enemy turns, fire a free reaction shot with your <Ability:BOUND_WEAPON_NAME/> at any visible enemy within four tiles who moves or fires."
; End Translation (2)
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[CloseandPersonal X2AbilityTemplate]
LocFriendlyName="Close and Personal"
LocFlyOverText="Close and Personal"
LocLongDescription="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocHelpText="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocPromotionPopupText="<Bullet/> Confers +30 critical chance against adjacent targets.<br/><Bullet/> Bonus reduced by 5% for each additional tile of distance from the target, down to 0% at 7 or more tiles.<br/>"

[DamnGoodGround X2AbilityTemplate]
LocFriendlyName="Damn Good Ground"
LocFlyOverText="Damn Good Ground"
LocLongDescription="Confers +10 aim and +10 defense against targets at a lower elevation."
LocHelpText="Confers +10 aim and +10 defense against targets at a lower elevation."
LocPromotionPopupText="<Bullet/> Confers +10 aim and +10 defense against targets at a lower elevation.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Executioner_LW X2AbilityTemplate]
LocFriendlyName="Executioner"
LocFlyOverText="Executioner"
; LWOTC Needs Translation
LocLongDescription="Confers +<Ability:EXECUTIONER_AIM_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points."
LocHelpText="Confers +<Ability:EXECUTIONER_AIM_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points."
LocPromotionPopupText="<Bullet/> Confers +<Ability:EXECUTIONER_CRIT_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points.<br/>"
; End Translation

[Resilience X2AbilityTemplate]
LocFriendlyName="Resilience"
LocFlyOverText="Resilience"
LocLongDescription="Enemy attacks against you suffer a -<ABILITY:RESILIENCE_BONUS_LW/> penalty to critical hit chances."
LocHelpText="Enemy attacks against you suffer a -<ABILITY:RESILIENCE_BONUS_LW/> penalty to critical hit chances."
LocPromotionPopupText="<Bullet/> Enemy attacks against you suffer a -<ABILITY:RESILIENCE_BONUS_LW/> penalty to critical hit chances.<br/>"

[TacticalSense X2AbilityTemplate]
LocFriendlyName="Tactical Sense"
LocFlyOverText="Tactical Sense"
LocLongDescription="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocHelpText="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocPromotionPopupText="<Bullet/> Gain 3 defense for each living enemy you can see, up to a maximum of 15 defense.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Aggression X2AbilityTemplate]
LocFriendlyName="Aggression"
LocFlyOverText="Aggression"
LocLongDescription="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocHelpText="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocPromotionPopupText="<Bullet/> Gain +5 critical chance for each enemy you can see, up to a maximum of 30.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/>"

[BringEmOn X2AbilityTemplate]
LocFriendlyName="Bring 'Em On"
LocFlyOverText="Bring 'Em On"
; LWOTC Needs Translation
LocLongDescription="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8. Works for the soldier's <Ability:BOUND_WEAPON_NAME/> and explosives."
LocHelpText="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8. Works for the soldier's <Ability:BOUND_WEAPON_NAME/> and explosives."
LocPromotionPopupText="<Bullet/> Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/><Bullet/> Applies to damage from the soldier's <Ability:BOUND_WEAPON_NAME/> and, if the soldier has Biggest Booms, explosives (damaging grenades, rockets, etc.).<br/>"
; End Translation

[HardTarget X2AbilityTemplate]
LocFriendlyName="Hard Target"
LocFlyOverText="Hard Target"
LocLongDescription="Gain 5 dodge per enemy you can see, up to a maximum of +30."
LocHelpText="Gain 5 dodge per enemy you can see, up to a maximum of +30."
LocPromotionPopupText="<Bullet/> Gain 5 dodge per enemy you can see, up to a maximum of +30.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

; LWOTC Needs Translation (2)
[Infighter X2AbilityTemplate]
LocFriendlyName="Infighter"
LocFlyOverText="Infighter"
LocLongDescription="Gain <Ability:INFIGHTER_DODGE_BONUS/> Dodge against attacks within four tiles."
LocHelpText="Gain <Ability:INFIGHTER_DODGE_BONUS/> Dodge against attacks within four tiles."
LocPromotionPopupText="<Bullet/> Gain <Ability:INFIGHTER_DODGE_BONUS/> Dodge against attacks within four tiles.<br/><Bullet/> Dodge bonus also applies to melee attacks.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking or otherwise impaired.<br/><Bullet/> Burning does not affect this ability."
; End Translation (2)

[DepthPerception X2AbilityTemplate]
LocFriendlyName="Depth Perception"
LocFlyOverText="Depth Perception"
LocLongDescription="Gain <Ability:DP_AIM_BONUS> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS> when at a higher elevation than your target."
LocHelpText="Gain <Ability:DP_AIM_BONUS> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS> when at a higher elevation than your target."
LocPromotionPopupText="<Bullet/> Gain <Ability:DP_AIM_BONUS> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS> when at a higher elevation than your target."

[WilltoSurvive X2AbilityTemplate]
LocFriendlyName="Will to Survive"
LocFlyOverText="Will to Survive"
LocLongDescription="Enemy damage is reduced by 1 when in cover and attacked through that cover. Also grants 5 will."
LocHelpText="Enemy damage is reduced by 1 when in cover and attacked through that cover."
LocPromotionPopupText="<Bullet/> Enemy damage is reduced by 1 when in cover and attacked through that cover.<br/><Bullet/> Cover against explosives and other indirect attacks is calculated from the point of the explosion.<br/><Bullet/> Armor piercing effects do not eliminate this bonus.<br/><Bullet/> This unit also permanently gains 5 will.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LightEmUp X2AbilityTemplate]
LocFriendlyName="Light 'Em Up"
LocFlyOverText="Light 'Em Up"
; LWOTC Needs Translation
LocLongDescription="Standard shots with your primary weapon are not turn-ending."
LocHelpText="Standard shots with your primary weapon are not turn-ending."
LocPromotionPopupText="<Bullet/> Standard shots with your primary weapon are not turn-ending.<br/>"
; End Translation

[CloseEncounters X2AbilityTemplate]
LocFriendlyName="Close Encounters"
LocFlyOverText="Close Encounters"
LocLongDescription="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CLOSE_ENCOUNTERS_RANGE/> tiles. Cannot trigger on the same turn as Hit and Run."
LocHelpText="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CLOSE_ENCOUNTERS_RANGE/> tiles."
LocPromotionPopupText="<Bullet/> Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CLOSE_ENCOUNTERS_RANGE/> tiles.<br/><Bullet/> A red ring will mark the range of this ability.<br/><Bullet/> Close Encounters cannot be used on the same turn as Run and Gun.<br/>"

; LWOTC Needs Translation
[LoneWolf X2AbilityTemplate]
LocFriendlyName="Lone Wolf"
LocFlyOverText="Lone Wolf"
LocLongDescription="Gain bonus Aim and Defense when at least <Ability:LONEWOLF_MIN_BONUS_TILES/> tiles distant from any ally, with a maximum of +<Ability:LONEWOLF_AIM_BONUS/>/+<Ability:LONEWOLF_DEF_BONUS/> at <Ability:LONEWOLF_MIN_DIST_TILES/>+ tiles."
LocHelpText="Gain bonus Aim and Defense when at least <Ability:LONEWOLF_MIN_BONUS_TILES/> tiles distant from any ally, with a maximum of +<Ability:LONEWOLF_AIM_BONUS/>/+<Ability:LONEWOLF_DEF_BONUS/> at <Ability:LONEWOLF_MIN_DIST_TILES/>+ tiles."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LONEWOLF_AIM_PER_TILE/> Aim and +<Ability:LONEWOLF_DEF_PER_TILE/> Defense for each tile of distance between this soldier and the nearest ally, starting at <Ability:LONEWOLF_MIN_BONUS_TILES/> tiles distant.<br/><Bullet/> Bonuses cap at +<Ability:LONEWOLF_AIM_BONUS/> Aim, +<Ability:LONEWOLF_DEF_BONUS/> Defense when <Ability:LONEWOLF_MIN_DIST_TILES/> or more tiles from the nearest ally.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."
; End Translation

[LowProfile X2AbilityTemplate]
LocFriendlyName="Low Profile"
LocFlyOverText="Low Profile"
LocLongDescription="Makes partial cover count as full."
LocHelpText="Makes partial cover count as full."
LocPromotionPopupText="<Bullet/> Makes partial cover count as full.<br/>"

[DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocFlyOverText="Double Tap"
LocLongDescription="Special shot: Fire two shots with your primary weapon at the same target. Requires both actions. Second shot is at a -10 aim penalty."
LocHelpText="Fire two shots at the same target with a to-hit penality on the second shot."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Double Tap allows you to take two shots at the same target, with the second shot at a -10 penalty to hit. It requires two actions and ends the turn.<br/><Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Double Tap has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"
; End Translation

[TraverseFire X2AbilityTemplate]
LocFriendlyName="Traverse Fire"
LocFlyOverText="Traverse Fire"
LocLongDescription="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocHelpText="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocPromotionPopupText="<Bullet/> After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action.<br/>"

; LWOTC needs translation
[WalkFire X2AbilityTemplate]
LocFriendlyName="Walk Fire"
LocFlyOverText="Walk Fire"
LocLongDescription="Take a highly accurate shot with +<Ability:WALK_FIRE_AIM_BONUS> bonus to hit <Ability:WALK_FIRE_DMG>% damage and -<Ability:WALK_FIRE_CRIT_MALUS> crit. Uses <Ability:SelfAmmoCost/> ammo."
LocHelpText="Special shot: +<Ability:WALK_FIRE_AIM_BONUS> aim, -<Ability:WALK_FIRE_CRIT_MALUS> crit, <Ability:WALK_FIRE_DMG>% damage, uses <Ability:SelfAmmoCost/> ammo."
LocPromotionPopupText="<Bullet/> This is a special shot in which the soldier adjusts their aim in the middle of an automatic weapon burst, conferring +<Ability:WALK_FIRE_AIM_BONUS> aim and -<Ability:WALK_FIRE_CRIT_MALUS> crit and doing <Ability:WALK_FIRE_DMG>% damage.<br/><Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."
; End translation

[PrecisionShot X2AbilityTemplate]
LocFriendlyName="Precision Shot"
LocFlyOverText="Precision Shot"
; LWOTC needs translation (2)
LocLongDescription="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS/> crit chance that deals <Ability:PRECISION_SHOT_CRIT_DAMAGE_MODIFIER/>% more damage if it crits. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS/> crit chance that deals <Ability:PRECISION_SHOT_CRIT_DAMAGE_MODIFIER/>% more damage if it crits. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocPromotionPopupText="<Bullet/> The damage bonus is applied multiplicatively to total damage after usual damage calculation."
; End translation (2)

[PrecisionShotSnapShot X2AbilityTemplate]
LocFriendlyName="Precision Shot (Snap Shot)"
LocFlyOverText="Precision Shot (Snap Shot)"
; LWOTC needs translation (2)
LocLongDescription="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS/> crit chance that deals <Ability:PRECISION_SHOT_CRIT_DAMAGE_MODIFIER/>% more damage if it crits. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS/> crit chance that deals <Ability:PRECISION_SHOT_CRIT_DAMAGE_MODIFIER/>% more damage if it crits. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocPromotionPopupText="<Bullet/> The damage bonus is applied multiplicatively to total damage after usual damage calculation."
; End translation (2)

[CyclicFire X2AbilityTemplate]
LocFriendlyName="Cyclic Fire"
LocFlyOverText="Cyclic Fire"
; LWOTC Needs Translation (2)
LocLongDescription="Special Shot: Fire three shots at a target in a single attack. Requires both actions and all shots have aim penalties. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Special Shot: Fire three shots at a target in a single attack. Requires both actions and all shots have aim penalties. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocPromotionPopupText="<Bullet/> Special Shot: Fire three shots at a target in a single attack. Requires two actions and all shots have a -<Ability:CYCLIC_FIRE_AIM_MALUS/> penalty to aim.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Cyclic Fire has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."
; End Translation (2)

[StreetSweeper X2AbilityTemplate]
LocFriendlyName="Trench Gun"
LocFlyOverText="Trench Gun"
; LWOTC Needs Translation
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets.<br/><Bullet/> Trench Gun has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Ability will not be available with other primary weapons.<br/><Bullet/> The shot will not penetrate heavy cover, so this ability is best used in flanking situations.<br/><Bullet/> Allies in the area of effect can take damage.<br/>
; End Translation

; LWOTC Needs Translation (2)
[SlugShot X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
; LWOTC needs Translation (4)
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot that pierces <Ability:SLUG_SHOT_PIERCE/> armor and has no range penalties and +<Ability:SLUG_SHOT_ACC_BONUS> extra accuracy. Uses <Ability:SelfAmmoCost/> ammo. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Armor-piercing special shotgun shot with no range penalties."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> The shot will pierce <Ability:SLUG_SHOT_PIERCE/> armor point(s).<br/><Bullet/> Slug shot has a <Ability:SelfCooldown_LW/> turn cooldown. <br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"


[SlugShotRangeEffect X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot with no range penalties and +<Ability:SLUG_SHOT_ACC_BONUS> extra accuracy. Uses <Ability:SelfAmmoCost/> ammo. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocHelpText="Special shot for primary-weapon shotguns only: Fire a shot with no range penalties. Uses <Ability:SelfAmmoCost/> ammo. Has a <Ability:SelfCooldown_LW/> turn cooldown."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> Slug Shot has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"
; End Translation (4)

[Commissar X2AbilityTemplate]
LocFriendlyName="Commissar"
LocFlyOverText="Commissar"
LocLongDescription="Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocHelpText="Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocPromotionPopupText="<Bullet/> Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs.<br/>"

[ClutchShot X2AbilityTemplate]
LocFriendlyName="Clutch Shot"
LocFlyOverText="Clutch Shot"
LocLongDescription="Once per mission, fire a pistol shot that cannot miss."
LocHelpText="Once per mission, fire a pistol shot that cannot miss."
LocPromotionPopupText="<Bullet/> Once per mission, fire a pistol shot that cannot miss.<br/>"

; LWOTC Needs Translation (3)
[Gunslinger X2AbilityTemplate]
LocFriendlyName="Gunslinger"
LocFlyOverText="Gunslinger"
LocLongDescription="Take a reaction shot that's guaranteed to hit and crit with your pistol against any enemy that moves or attacks within <Ability:GUNSLINGER_TILES_RANGE/> tiles."
LocHelpText="Enhanced radial pistol overwatch."
LocPromotionPopupText="<Bullet/> Range is <Ability:GUNSLINGER_TILES_RANGE/> tiles.<br/><Bullet/> Gunslinger has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Cannot be used from concealment."
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"
; End Translation (3)

[HyperReactivePupils X2AbilityTemplate]
LocFriendlyName="Hyper-Reactive Pupils"
LocFlyOverText="Hyper-Reactive Pupils"
LocLongDescription="Gain +<Ability:HYPERREACTIVE_PUPILS_AIM_BONUS> aim for your next shot with your primary weapon after a miss."
LocHelpText="Gain +<Ability:HYPERREACTIVE_PUPILS_AIM_BONUS> aim for your next shot with your primary weapon after a miss."
LocPromotionPopupText="<Bullet/> Bonus applies until the next time you hit a target or the mission ends.<br/><Bullet/> Area-of-Effect-based shots do not induce the bonus.<br/>"

[SteadyWeapon X2AbilityTemplate]
LocFriendlyName="Steady Weapon"
LocFlyOverText="Steady Weapon"
LocLongDescription="Gain +20 aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocHelpText="Gain +20 aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocPromotionPopupText="<Bullet/> Gain +20 aim on your next shot with your primary weapon. Bonus is lost if you use actions or are wounded.<br/><Bullet/> Cannot Steady Weapon when suppressed.<br/><Bullet/> Effect will persist through multiple turns if you do nothing.<br/><Bullet/> Using Steady Weapon over multiple consecutive turns will allow the bonus to stack."

[LockedOn X2AbilityTemplate]
LocFriendlyName="Locked On"
LocFlyOverText="Locked On"
; LWOTC Needs Translation (2)
LocLongDescription="Gain +<Ability:LOCKEDON_AIM_BONUS/> aim and +<Ability:LOCKEDON_CRIT_BONUS/> crit for successive shots with your <Ability:BOUND_WEAPON_NAME/> at the same enemy unit."
LocHelpText="Gain +<Ability:LOCKEDON_AIM_BONUS/> aim and +<Ability:LOCKEDON_CRIT_BONUS/> crit for successive shots with your <Ability:BOUND_WEAPON_NAME/> at the same enemy unit."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKEDON_AIM_BONUS/> aim and +<Ability:LOCKEDON_CRIT_BONUS/> crit for repeated shots with your <Ability:BOUND_WEAPON_NAME/> at the same target. Not cumulative, and only applies to enemy units.<br/><Bullet/> Area-of-Effect-based shots do not grant the bonus."
; End Translation (2)

[Sentinel_LW X2AbilityTemplate]
LocFriendlyName="Sentinel"
LocFlyOverText="Sentinel"
LocLongDescription="When in overwatch, you may take two reaction shots."
LocHelpText="When in overwatch, you may take two reaction shots."
LocPromotionPopupText="<Bullet/> Reaction shots may be at one or multiple targets, depending on alien movement.<br/>"

[RapidReaction X2AbilityTemplate]
LocFriendlyName="Rapid Reaction"
LocFlyOverText="Rapid Reaction"
LocLongDescription="When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of three shots."
LocHelpText="When in overwatch, each shot you hit with grants another shot, up to a maximum of three shots."
LocPromotionPopupText="<Bullet/> When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of three shots.<br/>"

[LightningReflexes_LW X2AbilityTemplate]
LocFriendlyName="Lightning Reflexes"
LocFlyOverText="Lightning Reflexes"
LocLongDescription="Reaction fire shots against you have a significantly decreased chance to hit. The bonus goes down with each additional reaction shot you face."
LocHelpText="Reaction fire shots against you have a decreased chance to hit."
LocPromotionPopupText="<Bullet/> Reaction fire shots against you have a significantly decreased chance to hit.<br/><Bullet/> The first reaction shot against you during a turn is at -100 to hit; the second at -80; the third at -60; the fourth at -40, and the fifth at -20. Further reaction shots at are normal to hit chances.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Cutthroat X2AbilityTemplate]
LocFriendlyName="Cutthroat"
LocFlyOverText="Cutthroat"
; LWOTC Needs Translation
LocLongDescription="Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."
LocHelpText="Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."
LocPromotionPopupText="<Bullet/> Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."
; End translation

[KillerInstinct X2AbilityTemplate]
LocFriendlyName="Killer Instinct"
LocFlyOverText="Killer Instinct"
; LWOTC Needs Translation
LocLongDescription="After activating Run and Gun, your critical hits deal <Ability:KILLER_INSTINCT_CRIT_DAMAGE_BONUS_PCT/>% more damage for the rest of the turn."
LocHelpText="After activating Run and Gun, your critical hits deal <Ability:KILLER_INSTINCT_CRIT_DAMAGE_BONUS_PCT/>% more damage for the rest of the turn."
LocPromotionPopupText="<Bullet/> The damage bonus is applied multiplicatively to total damage after usual damage calculation.<br/>"


[ExtraConditioning X2AbilityTemplate]
LocFriendlyName="Extra Conditioning"
LocFlyOverText="Extra Conditioning"
LocLongDescription="Run and Gun cooldown is reduced by one turn."
LocHelpText="Run and Gun cooldown is reduced by one turn."
LocPromotionPopupText="<Bullet/> Run and Gun cooldown is reduced by one turn.<br/>"
; End translation
[RunAndGun_LW X2AbilityTemplate]
LocFriendlyName="Run And Gun"
LocFlyOverText="Run And Gun"
LocLongDescription="Take an action after dashing. Activating this ability disables most other perks that give action points back like Close Encounters or Hit and Run"
LocHelpText="Take an action after dashing. Disables abilities that give action points to the soldier."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Run and Gun allows soldiers to close the distance to their targets rapidly, or to easily take a flanking position.<br/><Bullet/> Run and Gun has a <Ability:RUN_AND_GUN_COOLDOWN/> turn cooldown.<br/><Bullet/> This ability disables perks that give action points, like Close Encounters or Hit and Run.<br/>"
; End translation

[Suppression_LW X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"
LocLongDescription="Fire a barrage that pins down a target, grants reaction fire against it if it moves, restricts the use of many abilities, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will not stack.<br/><Bullet/> May not be used if sniper rifle or shotgun-class weapons are equipped.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades."
; End Translation

[AreaSuppression X2AbilityTemplate]
LocFriendlyName="Area Suppression"
LocFlyOverText="Area Suppression"
LocLongDescription="Fire a barrage that pins down multiple targets within a 4-tile radius, granting reaction fire against anyone that moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to all targets' aim until suppression is removed. Cannot be used when concealed."
LocHelpText="Suppress multiple targets within an area of effect."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Area Suppression cannot be used when the soldier is concealed.<br/><Bullet/> Any unit that attempts to move will face reaction fire as long as the suppressing unit has ammo remaining.<br/><Bullet/> Does not work with shotguns or sniper rifles.<br/><Bullet/> Area Suppression costs <Ability:SelfAmmoCost/> ammo points to use, plus one additional ammo for each reaction shot. It has no cooldown.<br/><Bullet/> Area suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will not stack.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades.""
; End Translation

[SuppressionShot_LW X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"

[DangerZone X2AbilityTemplate]
LocFriendlyName="Danger Zone"
LocFlyOverText="Danger Zone"
LocLongDescription="Area Suppression suppresses enemies in a 5-tile radius."
LocHelpText="Wider Area Suppression."
LocPromotionPopupText="<Bullet/> Area Suppression suppresses enemies in a 5-tile radius.<br/>

[Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +<Ability:LOCKDOWN_TOHIT_BONUS/> to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKDOWN_TOHIT_BONUS/> to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[LockdownBonuses X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +<Ability:LOCKDOWN_TOHIT_BONUS/> to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKDOWN_TOHIT_BONUS/> to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[Mayhem X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT/>% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT/>% bonus damage against enemies who attempt to move when suppressed.<br/>"

[MayhemBonuses X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT/>% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT/>% bonus damage against enemies who attempt to move when suppressed.<br/>"

[Interference X2AbilityTemplate]
LocFriendlyName="Interference"
LocFlyOverText="Interference"
; LWOTC Needs Translation (2)
LocLongDescription="GREMLIN cancels overwatch on targeted unit."
; End Translation (2)
LocHelpText="Cancels overwatch on targeted unit."
; LWOTC Needs Translation (2)
LocPromotionPopupText="<Bullet/> Cancels overwatch on targeted unit.<br/><Bullet/> Is a free action.<br/><Bullet/> 3 charges per battle, plus 2 extra charges per better Gremlin tech.<br/>"
; End Translation (2)

[DamageControl X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocFlyOverText="Damage Control"
LocLongDescription="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocHelpText="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocPromotionPopupText="<Bullet/> Your armor hardens temporarily after an impact. After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the next turn.

[DamageControlPassive X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocFlyOverText="Damage Control"
LocLongDescription="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocHelpText="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocPromotionPopupText="<Bullet/> Your armor hardens temporarily after an impact. After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the next turn.

[Evasive X2AbilityTemplate]
LocFriendlyName="Evasive"
LocFlyOverText="Evasive: +100 Dodge"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[RemoveEvasive X2AbilityTemplate]
LocFriendlyName="Evasive bonus lost"
LocFlyOverText="Evasive bonus lost"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[SnapShot X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocHelpText="Shoot the target."
;LocLongDescription="You may take standard shots with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range."
;LocPromotionPopupText="<Bullet/> The soldier may now use the sniper rifle for standard shots after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on those shots.<br/><Bullet/> The soldier may not enter overwatch with the sniper rifle after moving.<br/>

LocLongDescription="You may take standard shots with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range on all shots."
LocPromotionPopupText="<Bullet/> This ability significantly alters the way the Sharpshooter operates: The soldier may now use the sniper rifle for standard shots after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on all shots, regardless of whether the soldier has moved or not.<br/><Bullet/> Only works with Sniper Rifles.<br/><Bullet/> Reduces close range penalties by <Ability:WPN_HANDLING_MODIFIER/> relative to normal sniper rifles.<br/><Bullet/> After 5 tiles of squadsight, suffer an additional -20 aim per tile.<br/><Bullet/> Certain special shots and Long Watch still require both actions to use. Long Watch enables squadsight overwatch fire, but the range penalties still apply.<br/><Bullet/> The solder will not take an overwatch or Kill Zone shot without at least a 1% chance to hit."

[SnapShotOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to to aim. The solder will not take an overwatch shot without at least a 1% chance to hit."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[SnapShotAimModifier X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocLongDescription="You may take standard shots with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range on all shots."
LocHelpText="Allows standard shots with sniper rifles after moving."

[Trojan X2AbilityTemplate]
LocFriendlyName="Trojan"
LocFlyOverText="Trojan"
LocLongDescription="Enemy units that are hacked take damage and lose their actions on the turn the hack effect ends. Trojan will never break squads concealment even if it fails to destroy its target."
LocHelpText="Hacked units suffer damage and action loss when hack effect ends. This ability lets our Specialists destroy Advent Drones without breaking concealment. Even if the victim survives the Trojan attack, concealment will not be broken."
LocPromotionPopupText="<Bullet/> Enemy units hacked by Haywire Protocol take 0 to 8 damage and lose their actions on the turn the hack effect ends.<br/><Bullet/> Applies to units stunned or taken over by Haywire Protocol.<br/><Bullet/> Damage calculated based on Hacking Stat vs. target's Hack Defense.<br/>"

[Covert X2AbilityTemplate]
LocFriendlyName="Covert"
LocFlyOverText="Covert"
; LWOTC Needs Translation
LocLongDescription="Enemies have <Ability:COVERT_DETECTION_RANGE_REDUCTION/>% smaller detection range against you."
LocHelpText="Enemies have reduced detection range against you."
LocPromotionPopupText="<Bullet/> Enemies have <Ability:COVERT_DETECTION_RANGE_REDUCTION/>% smaller detection range against you, as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> This ability also grants a small reduction in this soldier's impact on infiltration times.<br/><Bullet/> Does not apply to ADVENT security towers."
; End Translation

[Ghostwalker X2AbilityTemplate]
LocFriendlyName="Ghostwalker"
LocFlyOverText="Ghostwalker"
; LWOTC Needs Translation (2)
LocLongDescription="Activate this ability to reduce enemy detection range against you by almost <Ability:GHOSTWALKER_DETECTION_RANGE_REDUCTION/>% for <Ability:GHOSTWALKER_DURATION/> turn(s)."
LocHelpText="Reduce enemy detection range by <Ability:GHOSTWALKER_DETECTION_RANGE_REDUCTION/>% for <Ability:GHOSTWALKER_DURATION/> turn(s)."
LocPromotionPopupText="<Bullet/> Activate this ability to reduce enemy detection range against you by almost <Ability:GHOSTWALKER_DETECTION_RANGE_REDUCTION/>% for <Ability:GHOSTWALKER_DURATION/> turn(s) (including the current turn), as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> Ghostwalker has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Requires no actions to activate.<br/><Bullet/> This ability also grants a small reduction in this soldier's impact on infiltration times.<br/><Bullet/> Does not apply to ADVENT security towers."
; End Translation (2)

[Kubikuri X2AbilityTemplate]
LocFriendlyName="Kubikiri"
LocFlyOverText="Kubikiri"
LocLongDescription="Special shot against most enemies who have taken any damage: Any critical hit kills them, but regular hits do half damage. Requires two actions and has a 4-turn cooldown."
LocHelpText="Crits automatically kill enemies at less than full hit points. Regular hits do half damage."
LocPromotionPopupText="<Bullet/> Special shot against enemies with less than full hit points: Any critical hit kills them, but regular hits do half damage.<br/><Bullet/> Requires two actions.<br/><Bullet/> 4-turn cooldown.<br/><Bullet/> Against alien rulers, a critical hit will do double normal crit damage instead of killing the enemy outright."

[CombatAwareness X2AbilityTemplate]
LocFriendlyName="Combat Awareness"
LocFlyOverText="Combat Awareness"
LocLongDescription="Grants <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor when on overwatch or suppressing."
LocHelpText="Grants <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor when on overwatch or suppressing."
LocPromotionPopupText="<Bullet/> Gain <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor point when on overwatch or suppressing.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[FieldSurgeon X2AbilityTemplate]
LocFriendlyName="Field Surgeon"
LocFlyOverText="Field Surgeon"
LocLongDescription="Reduce wound recovery times for most soldiers."
LocHelpText="Reduce wound recovery times for most soldiers."
LocPromotionPopupText="<Bullet/> Field Surgeon reduces the number of hit points a soldier must heal after being wounded in battle by 1.<br/><Bullet/> Multiple Field Surgeons on a mission have a chance to reduce wound recovery time further.<br/><Bullet/> The effect includes the soldier with the ability.<br/><Bullet/> It does not affect soldiers who suffered killing wounds and are stabilized from bleeding out."

[Flashbanger X2AbilityTemplate]
LocFriendlyName="Flashbanger"
LocFlyOverText="Flashbanger"
LocLongDescription="Grants 1 free flashbang item to your inventory."
LocHelpText="Grants 1 free flashbang item to your inventory."
LocPromotionPopupText="<Bullet/> Grants 1 free flashbang item to your inventory.<br/>"

[SmokeGrenade X2AbilityTemplate]
LocFriendlyName="Smoker"
LocFlyOverText="Smoker"
LocLongDescription="Grants one free smoke grenade item to your inventory."
LocHelpText="Grants one free smoke grenade item to your inventory."
LocPromotionPopupText="<Bullet/> Grants one free smoke grenade item to your inventory.<br/>"

[Savior X2AbilityTemplate]
LocFriendlyName="Savior"
LocFlyOverText="Savior"
LocLongDescription="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL/> additional hit points."
LocHelpText="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL/> additional hit points."
LocPromotionPopupText="<Bullet/> Effect applies to GREMLIN heal, Medikits and Restoration abilities.<br/>"

[DenseSmoke X2AbilityTemplate]
LocFriendlyName="Dense Smoke"
LocFlyOverText="Dense Smoke"
LocLongDescription="Your smoke grenades confer an additional 10 defense."
LocHelpText="Your smoke grenades confer an additional 10 defense."
LocPromotionPopupText="<Bullet/> Your smoke grenades confer an additional 10 defense to those within the smoke, for a total of 30.<br/>"


[Collateral_LW X2AbilityTemplate]
LocFriendlyName="Collateral Damage"
LocLongDescription="Fire a barrage of <Ability:WeaponName/> rounds to a location, destroying cover within the area. Deals a small amount of damage to enemies. 3-turn cooldown and uses 2 ammo."
LocHelpText="Fire a barrage of <Ability:WeaponName/> rounds to a location, destroying cover within the area."
LocFlyOverText="Collateral Damage"
LocPromotionPopupText="<Bullet/> Fire a barrage of <Ability:WeaponName/> rounds to a location, destroying cover within the area.<br/><Bullet/> Deals high environmental damage to all objects in the area of effect.<br/><Bullet/> Collateral Damage does 1-2/2/2-3 damage to enemies within the area of effect depending on tier of equipped <Ability:WeaponName/>.<br/><Bullet/> Costs 2 ammo and has a 3-turn cooldown.<br/>"


[DenseSmokeGrenade X2GrenadeTemplate]
FriendlyName="Dense Smoke Grenade"
FriendlyNamePlural="Dense Smoke Grenades"
BriefSummary="Provides a increased defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br/><Bullet/> Smoke grenades can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Dense Smoke Grenade"
ThrownAbilityHelpText="Grants a defensive boost to units within its radius."
LaunchedAbilityname="Launch Dense Smoke Grenade"
LaunchedAbilityHelpText="Grants a defensive boost to units within its radius."

[DenseSmokeGrenadeMk2 X2GrenadeTemplate]
FriendlyName="Dense Smoke Bomb"
FriendlyNamePlural="Dense Smoke Bombs"
BriefSummary="The upgraded Dense Smoke Bomb provides a significant defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Dense Smoke Bombs, a powerful upgrade to our earlier Smoke Grenades, grant greater defense in a larger radius.<br/><Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br/><Bullet/> Smoke Bombs can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Dense Smoke Bomb"
ThrownAbilityHelpText="Grants a significant defensive boost to units within its radius."
LaunchedAbilityname="Launch Dense Smoke Bomb"
LaunchedAbilityHelpText="Grants a significant defensive boost to units within its radius."

[StingGrenades X2AbilityTemplate]
LocFriendlyName="Sting Grenades"
LocFlyOverText="Sting Grenades"
LocLongDescription="Your flashbang grenades have a 50% chance to stun enemies for one turn in the flashbang's Area of Effect."
LocHelpText="Your flashbang grenades have a 50% chance to stun enemies."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Your flashbang grenades have a 50% chance to stun enemies.<br/><Bullet/> Enemies' innate flashbang resistance does not affect stun chance.<br/>"
; End Translation

[DedicatedSuppression_LW X2AbilityTemplate]
LocFriendlyName="Dedicated Suppression"
LocLongDescription="Taking damage no longer cancels Suppression and Area Suppression."
LocHelpText="Taking damage no longer canccels Suppression and Area Suppression."

[X2Item_StingGrenade]
DenseSmokeGrenadeEffectDisplayName="Sting Grenade"
DenseSmokeGrenadeEffectDisplayDesc="Sting Grenades have a 50% chance to stun units within the grenades' area of effect."

[StingGrenade X2GrenadeTemplate]
FriendlyName="Sting Grenade"
FriendlyNamePlural="Sting Grenades"
BriefSummary="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."
TacticalText="<Bullet/> Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them.<br/>"
ThrownAbilityName="Throw Sting Grenade"
ThrownAbilityHelpText="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."
LaunchedAbilityname="Launch Sting Grenade"
LaunchedAbilityHelpText="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."

[RapidDeployment X2AbilityTemplate]
LocFriendlyName="Rapid Deployment"
LocFlyOverText="Rapid Deployment"
LocLongDescription="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action."
LocHelpText="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action."
; LWOTC Needs Translation (2)
LocPromotionPopupText="<Bullet/> Activate this ability before throwing or launching a support grenade, and the throw will not cost an action.<br/><Bullet/> Applies to Smoke Grenades, Flashbangs, Shaped Charges and Battle Scanners.<br/><Bullet/> Rapid Deployment has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"
; End Translation (2)

[CombatRush X2AbilityTemplate]
LocFriendlyName="Combat Rush"
LocFlyOverText="Combat Rush"
LocLongDescription="When you kill an enemy, allies within <Ability:COMBAT_RUSH_RADIUS> tiles receive +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility for <Ability:COMBAT_RUSH_DURATION> turns. <Ability:COMBAT_RUSH_COOLDOWN> turn cooldown."
LocHelpText="When you kill an enemy, allies within <Ability:COMBAT_RUSH_RADIUS> tiles receive +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility for <Ability:COMBAT_RUSH_DURATION> turns. <Ability:COMBAT_RUSH_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Combat Rush triggers when you kill an enemy unit and provides allies within <Ability:COMBAT_RUSH_RADIUS> tiles +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility.<br/><Bullet/> The effect lasts for <Ability:COMBAT_RUSH_DURATION> after the kill.<br/><Bullet/> It can only trigger every <Ability:COMBAT_RUSH_COOLDOWN> turns.<br/>"

[BroadcastCombatRush X2AbilityTemplate]
LocFriendlyName="Combat Rush"
LocFlyOverText="Combat Rush"
LocLongDescription="Nearby ally grants you +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility for <Ability:COMBAT_RUSH_DURATION> turns."
LocHelpText="Nearby ally grants you +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility for <Ability:COMBAT_RUSH_DURATION> turns."

; LWOTC Needs Translation (2)
[GrazingFire X2AbilityTemplate]
LocFriendlyName="Grazing Attacks"
LocFlyOverText="Grazing Attacks"
LocLongDescription="Your missed attacks have an additional roll to become a graze."
LocHelpText="Misses may become grazes."
LocPromotionPopupText="<Bullet/> Soldier's missed attacks generally have a <Ability:GRAZING_FIRE_SUCCESS_CHANCE>% chance to become a graze.<br/><Bullet/> This effect occurs after normal hit-miss-graze processing.<br/><Bullet/> Targets with a dodge score subtract that score from the ability's success chance.<br/><Bullet/> Works with all weapon attacks including knife attacks and sword slices. <br/>"
; End Translation (2)

[HeavyFrags X2AbilityTemplate]
LocFriendlyName="Boosted Cores"
LocFlyOverText="Boosted Cores"
LocLongDescription="Explosive grenades and any damage over time effects inflicted by grenades do one additional damage."
LocHelpText="Explosive grenades do one additional damage."
; LWOTC Needs Translation (2)
LocPromotionPopupText="<Bullet/> Your grenades have extra explosives and do one additional damage but require special training to handle.<br/><Bullet/>Damage over time effects applied by grenades such as poison will also do one additional damage.<br/>"
; End Translation (2)

[Airdrop X2AbilityTemplate]
LocFriendlyName="Airdrop"
LocFlyOverText="Airdrop"
; LWOTC Needs Translation
LocLongDescription="The Gremlin grants an explosive grenade to the targeted ally. Usable <Ability:NUM_AIRDROP_CHARGES/> time(s) per mission."
LocHelpText="Grants an explosive grenade to the targeted ally."
LocPromotionPopupText="<Bullet/> Grants an explosive grenade to the targeted ally.<br/><Bullet/> Airdrop initially confers a frag grenade, but as XCOM's technology improves it will instead provide a more advanced device.<br/><Bullet/> Activating Airdrop uses one action and does not end the soldier's turn.<br/><Bullet/> Activating Airdrop does not break concealment.<br/><Bullet/> Usable <Ability:NUM_AIRDROP_CHARGES/> time(s) per mission."
; End Translation

[SwordSlice_LW X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/> Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position up to <Ability:MAX_SLICE_FLECHE_DAMAGE/> maximum bonus damage..<br/>"
; End Translation

[Fleche X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/> Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position up to <Ability:MAX_SLICE_FLECHE_DAMAGE/> maximum bonus damage.<br/>"
; End Translation

[FullKit X2AbilityTemplate]
LocFriendlyName="Full Kit"
LocFlyOverText="Full Kit"
LocLongDescription="Grants +1 charge per grenade item in a utility slot."
LocHelpText="Grants +1 charge per grenade item in a utility slot."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Grants +1 charge per grenade item in a utility slot.<br/><Bullet/> Applies to explosive and support grenades as well as Battle Scanners.<br/><Bullet/> Extra grenades provided by Smoker and Flashbanger abilities do not get extra charges.<br/>"
; End Translation

[Bastion X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BastionPassive X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BastionCleanse X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[IronCurtain X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocFlyOverText="Iron Curtain"
; LWOTC Needs Translation
LocLongDescription="Special shot that does <Ability:IRON_CURTAIN_DAMAGE_MODIFIER/>% of normal damage but reduces target mobility for the following <Ability:IRON_CURTAIN_MOB_DAMAGE_DURATION/> turn(s). Cone-based attack with primary weapon."
LocHelpText="Special shot that does low damage but reduces enemy mobility for the following two turns."
LocPromotionPopupText="<Bullet/> If this cone-based attack hits, Iron Curtain does <Ability:IRON_CURTAIN_DAMAGE_MODIFIER/>% of normal damage and imposes -<Ability:IRON_CURTAIN_MOBILITY_DAMAGE> mobility to the enemy for <Ability:IRON_CURTAIN_MOB_DAMAGE_DURATION/> turn(s).<br/><Bullet/> Iron Curtain has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Uses <Ability:IRON_CURTAIN_AMMO_COST> ammo.<br/><Bullet/> Can be used after moving.<br/><Bullet/> Iron Curtain does not work with shotguns or sniper rifles.<br/><Bullet/> Allies in the cone can be hit by this ability.<br/>"
; End Translation

[IronCurtainShot X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocFlyOverText="Iron Curtain"
LocLongDescription="Special shot that does low damage but reduces enemy mobility for the following two turns. Cone-based attack with primary weapon."
LocHelpText="Special shot that does low damage but reduces enemy mobility for the following two turns."
LocPromotionPopupText="<Bullet/> If it hits, Iron Curtain does 25% normal damage and imposes -4 mobility to the enemy for two turns.<br/><Bullet/> Four-turn cooldown.<br/><Bullet/> Uses <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Can be used after moving.<br/><Bullet/> Iron Curtain does not work with shotguns or sniper rifles.<br/>"
str_IronCurtainEffect="Iron Curtain"

[Slash_LW X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[AbsorptionFields X2AbilityTemplate]
LocFriendlyName="Impact Fields"
LocFlyOverText="Impact Fields"
LocLongDescription="Use an action to activate a force field that reduces incoming damage by 33% for <Ability:ABSORPTION_FIELDS_DURATION> turns. <Ability:ABSORPTION_FIELDS_COOLDOWN> turn cooldown."
LocHelpText="Use an action to activate a force field that reduces incoming damage by 33% for <Ability:ABSORPTION_FIELDS_DURATION> turns. <Ability:ABSORPTION_FIELDS_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Activate a force field that reduces incoming damage by 33% for <Ability:ABSORPTION_FIELDS_DURATION> turns.<br/><Bullet/> <Ability:ABSORPTION_FIELDS_COOLDOWN> turn cooldown.<br/><Bullet/> Uses one action and doesn't automatically end your turn.<br/><Bullet/> Armor-Piercing weapons do not mitigate this effect.<br/>"

[BodyShield X2AbilityTemplate]
LocFriendlyName="Body Shield"
LocFlyOverText="Body Shield"
LocLongDescription="Target an enemy as a free action to confer it -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against you for <Ability:BODY_SHIELD_DURATION> turns. <BODY_SHIELD_COOLDOWN> turn cooldown."
LocHelpText="Target an enemy as a free action to confer it -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against you for <Ability:BODY_SHIELD_DURATION> turns. <BODY_SHIELD_COOLDOWN> turn cooldown."
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> A targeted enemy receives -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against this unit.<br/><Bullet/> This is a free action.<br/><Bullet/> Body Shield has a <Ability:SelfCooldown_LW/> turn cooldown."
; End Translation

[EmergencyLifeSupport X2AbilityTemplate]
LocFriendlyName="Emergency Life Support"
LocFlyOverText="Emergency Life Support"
LocLongDescription="This implant drastically increases the threshold of overkill damage needed to bypass bleedout, making it less likely that your soldier dies when fatally shot. Bleedout timer is extended by <Ability:EMERGENCY_LIFE_SUPPORT_BONUS_BLEEDINGOUT_TURNS> turns."
LocPromotionPopupText="<Bullet/> Emergency Life Support drastically increases the threshold of overkill damage needed to bypass bleedout.<br/><Bullet/> Adds <Ability:EMERGENCY_LIFE_SUPPORT_BONUS_BLEEDINGOUT_TURNS> turns to the bleedout timer.<br/>"

[IronSkin X2AbilityTemplate]
LocFriendlyName="Iron Skin"
LocFlyOverText="Iron Skin"
LocLongDescription="Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>."
LocHelpText="Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>."
LocPromotionPopupText="<Bullet/> Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>.<br/>"

[SmartMacrophages X2AbilityTemplate]
LocFriendlyName="Smart Macrophages"
LocFlyOverText="Smart Macrophages"
LocLongDescription="Heals injuries after a battle, lowering wound recovery time, and confers immunity to poison and acid."
LocHelpText="Lowers wound recovery time and confers immunity to poison and acid."
LocPromotionPopupText="<Bullet/> The number of hit points you lost during a battle, which is used to calculate time out wounded, is reduced by one.<br/><Bullet/> You are immune to poison and acid.<br/>"

[MindMerge X2AbilityTemplate]
LocFriendlyName="Mind Merge"
LocFlyOverText="Mind Merge"
LocLongDescription="Grants bonus will, critical chance and ablative hit points to an ally until the beginning of the player's next turn."
LocHelptext="Temporarily grants bonus will, critical chance and ablative hit points to an ally."
; LWOTC Needs Translation (2)
LocPromotionPopupText="<Bullet/> Grants the targeted ally 1 ablative (shield) hit point, plus another one per 20 psi offense score of the Psi Operative using Mind Merge.<br/><Bullet/> Grants the targeted ally 1 will per 5 psi offense score of the Psi Operative.<br/><Bullet/> Also grants the ally +1 critical chance per 7 psi offense score of the Psi Operative.<br/><Bullet/> Effect lasts until the Psi Operative's next turn.<br/><Bullet/> Mind Merge has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Mind Merge requires one action and does not end your turn.<br/><Bullet/> Only visible allies may be targeted.<br/><Bullet/> Improved Psi Amps grant additional bonuses to these effects.<br/><Bullet/> If the Psi Operative is employed as Haven Adviser Mind Merge will reduce the chance of recruiting Faceless rebels by 40% (stacking cumulatively with other similar abilities).<br/>"
; End Translation (2)

[SoulMerge X2AbilityTemplate]
LocFriendlyName="Soul Merge"
LocFlyOverText="Soul Merge"
LocLongDescription="Increases effectiveness of Mind Merge by conferring larger bonuses to critical chance, will and ablative hit points, and reducing its cooldown period."
LocHelpText="Increases effectiveness of Mind Merge."
LocPromotionPopupText="<Bullet/> Reduces Mind Merge cooldown by 1 turn.<br/><Bullet/> Bonus ablative Hit Points improves to 1 per 20 psi offense score.<br/><Bullet/> Bonus will improves to 1 per 5 psi offense score.<br/><Bullet/> Grants a crit bonus of 1% per 5 psi offense."

[Shadowstrike_LW X2AbilityTemplate]
LocFriendlyName="Shadowstrike"
LocLongDescription="While concealed, gain +<Ability:SHADOWSTRIKEAIM/> bonus aim and +<Ability:SHADOWSTRIKECRIT/> bonus critical hit chance when attacking enemies."
LocHelpText="While concealed, gain bonus aim and bonus criticial hit chance when attacking enemies."
LocPromotionPopupText="<Bullet/> Shadowstrike bonuses will apply if the soldier re-enters concealment in a mission.<br/>"

[Formidable X2AbilityTemplate]
LocFriendlyName="Formidable"
LocFlyOverText="Formidable"
; LWOTC Needs Translation
LocLongDescription="Your gear includes an extra layer of protection, granting <Ability:FORMIDABLE_ABLATIVE_HP/> bonus ablative hit points and <Ability:FORMIDABLE_EXPLOSIVES_DR/>% less damage from explosive attacks."
LocHelpText="Gain bonus hit points and reduce explosive damage taken."
LocPromotionPopupText="<Bullet/> Formidable reduces explosive damage taken by <Ability:FORMIDABLE_EXPLOSIVES_DR/>%.
; End Translation

; Updated perk loc

[XComGame.PistolStandardShot X2AbilityTemplate]
[PistolStandardShot X2AbilityTemplate]
LocFriendlyName="Fire Pistol"
LocLongDescription="You have been trained to effectively utilize the full flexibility of a pistol as a complement to your primary weapon."
LocHelpText="Fire your pistol at a target."
LocFlyOverText=""

[XComGame.Killzone X2AbilityTemplate]
[KillZone X2AbilityTemplate]
LocFriendlyName="Kill Zone"
LocLongDescription="Take a reaction shot against any enemy that moves or attacks within a cone of fire."
LocHelpText="Enhanced overwatch in a cone of fire."
LocFlyOverText="Kill Zone"
LocPromotionPopupText="<Bullet/> There is no limit to the amount of Kill Zone shots a soldier can take outside of ammo counts.<br/><Bullet/> Kill Zone utilizes Squadsight, even if the soldier does not have the Long Watch ability.<br/><Bullet/> Kill Zone has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"
LocFriendlyNameWhenConcealed="Kill Zone (Concealed)"

[XComGame.DeathFromAbove X2AbilityTemplate]
[DeathFromAbove X2AbilityTemplate]
LocFriendlyName="Death From Above"
; LWOTC Needs Translation
LocLongDescription="Killing an enemy at a lower elevation with your <Ability:WeaponName/> refunds a single action, and does not end your turn. Also grants a long-range accuracy bonus for sniper rifles and vektor rifles."
LocHelpText="Killing an enemy at a lower elevation with your <Ability:WeaponName/> refunds a single action, and does not end your turn."
; End Translation
LocFlyOverText="Death From Above"
LocPromotionPopupText="<Bullet/> Death From Above can combo well with pistol abilities or can simply make a soldier more mobile.<br/><Bullet/> Also grants a long-range accuracy bonus for sniper rifles at any elevation."

[XComGame.Implacable X2AbilityTemplate]
[Implacable X2AbilityTemplate]
LocFriendlyName="Implacable"
LocLongDescription="Once per turn, killing an enemy grants you a movement-only action point."
LocHelpText="Gain up to one move per turn after making a kill."
LocFlyOverText="Implacable"
LocPromotionPopupText=""

[XComGame.VolatileMix X2AbilityTemplate]
[VolatileMix X2AbilityTemplate]
LocFriendlyName="Volatile Mix"
LocLongDescription="Your grenades' area of effect is increased by one tile."
LocHelpText="Your grenades cover a greater area of effect."
LocFlyOverText="Volatile Mix"
LocPromotionPopupText="<Bullet/> Your grenades do regular and environmental damage in the expanded area of effect, and apply any additional effects there as well.

[XComGame.Salvo X2AbilityTemplate]
[Salvo X2AbilityTemplate]
LocFriendlyName="Salvo"
LocLongDescription="Launching or throwing grenades, using heavy weapons or using the Gauntlet's Rocket Launcher with your first action will not end your turn."
LocHelpText="Grenades can be launched or thrown and heavy weapons and the Gauntlet's Rocket Launcher can be fired without ending the turn."
LocFlyOverText="Salvo"
LocPromotionPopupText="<Bullet/> Soldiers with the Salvo ability are prime candidates for heavy armor.<br/>"

[XComGame.Quickdraw X2AbilityTemplate]
[Quickdraw X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Firing your pistol with your first action no longer ends your turn."
LocHelpText="Firing your pistol with your first action no longer ends your turn."
LocFlyOverText="Quickdraw"
LocPromotionPopupText="<Bullet/> Quickdraw allows the soldier to spread their fire around to different targets in the same turn.<br/>"

; LWOTC Needs Translation (2)
[XComGame.SharpshooterAim X2AbilityTemplate]
[SharpshooterAim X2AbilityTemplate]
LocFriendlyName="Aim"
LocLongDescription="Hunker Down now confers +<Ability:SHARPSHOOTERAIMBONUS/> Aim and +<Ability:SHARPSHOOTERAIM_CRITBONUS/> Crit to the first shot on the following turn."
LocHelpText="Hunker Down now confers +<Ability:SHARPSHOOTERAIMBONUS/> Aim and +<Ability:SHARPSHOOTERAIM_CRITBONUS/> Crit to the first shot on the following turn."
LocFlyOverText="HunkerDown - Aim"
LocPromotionPopupText="<Bullet/> The bonus granted by Aim can apply to any weapon shot.<br/>"
; End Translation (2)

[XComGame.LightningHands X2AbilityTemplate]
[LightningHands X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your pistol at a target. This attack does not cost an action."
LocHelpText="Fire your pistol at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> Lightning Hands can combo well with two-action abilities, as it does not prevent their use in the same turn.<br/><Bullet/> Lightning Hands has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"

[XComGame.IntrusionProtocol X2AbilityTemplate]
[IntrusionProtocol X2AbilityTemplate]
LocFriendlyName="Hack"
LocLongDescription="Attempt to remotely breach security on a network access point with your <Ability:BOUND_WEAPON_NAME/>."
LocHelpText="You can remotely hack targets with your <Ability:BOUND_WEAPON_NAME/>."
LocFlyOverText="Hack"
LocPromotionPopupText="<Bullet/> Map items (chests, workstations, etc.) can be hacked from a distance using the <Ability:BOUND_WEAPON_NAME/>.<br/>"

[XComGame.EverVigilant X2AbilityTemplate]
[EverVigilant X2AbilityTemplate]
LocFriendlyName="Ever Vigilant"
LocLongDescription="If you spend all of your actions on moves, you are granted an automatic overwatch shot at the end of the turn."
LocHelpText="Automatically activate Overwatch if you did nothing but move this turn."
LocFlyOverText="Overwatch: Ever Vigilant"
LocPromotionPopupText="<Bullet/> Ever Vigilant enables an extremely mobile style of play for the soldier.<br/><Bullet/> Any action other than moving will invalidate Ever Vigilant.<br/>"

[XComGame.Phantom X2AbilityTemplate]
[Phantom X2AbilityTemplate]
LocFriendlyName="Phantom"
LocLongDescription="When the squad is revealed, this soldier remains concealed."
LocHelpText="When the squad is revealed, this soldier remains concealed."
LocFlyOverText="Phantom"
LocPromotionPopupText="<Bullet/> Even if the squad does not start a mission concealed, soldiers with Phantom will still begin the mission with concealment.<br/><Bullet/> If the soldier with Phantom is the one who breaks squad concealment, then Phantom does not apply.<br/>"

[XComGame.Shadowstep X2AbilityTemplate]
[Shadowstep X2AbilityTemplate]
LocFriendlyName="Shadowstep"
LocLongDescription="This soldier does not trigger overwatch or reaction fire."
LocHelpText="This soldier does not trigger overwatch or reaction fire."
LocPromotionPopupText="<Bullet/> A soldier with Shadowstep will not trigger Overwatch shots or Suppression fire, but they will be unable to draw Overwatch fire away from their teammates.<br/>"

[XComGame.Bladestorm X2AbilityTemplate]
[Bladestorm X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the soldier.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[XComeGame.BladestormAttack X2AbilityTemplate]
[BladestormAttack X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the soldier.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[XComGame.Untouchable X2AbilityTemplate]
[Untouchable X2AbilityTemplate]
LocFriendlyName="Untouchable"
LocLongDescription="If you score a kill during your turn, the next attack against you during the enemy turn will miss."
LocHelpText="If you score a kill during your turn, the next attack against you during the enemy turn will miss."
LocFlyOverText="Untouchable"
LocPromotionPopupText="<Bullet/> When Untouchable is triggered the soldier is immune to the next damage dealing attack during the enemy turn, even Area of Effect attacks.<br/>"

[XComGame.Stealth X2AbilityTemplate]
[Stealth X2AbilityTemplate]
LocFriendlyName="Conceal"
LocLongDescription="Immediately enter concealment once per mission."
LocHelpText="Immediately enter concealment once per mission."
LocFlyOverText="Conceal"
; LWOTC Needs Translation
LocPromotionPopupText="<Bullet/> Concealment cannot be used when flanked by nearby enemies.<br/><Bullet/> Requires one action and ends the soldier's turn."
; End Translation

[XComGame.RevivalProtocol X2AbilityTemplate]
[RevivalProtocol X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Revival Protocol can be used to revive unconscious soldiers, including those who have been stabilized after bleeding out.<br/><Bullet/> Revival Protocol, if used with your first action, will not end your turn.<br/><Bullet/> Starts with two charges, but upgrading your GREMLIN may provide more.<br/>"

[XComGame.ThreatAssessment X2AbilityTemplate]
[ThreatAssessment X2AbilityTemplate]
LocLongDescription="Aid Protocol grants the target a Covering Fire Overwatch shot."
LocPromotionPopupText="<Bullet/> Aid Protocol grants the target a Covering Fire Overwatch shot."

; Gear loc updates for new classes

[XComGame.Shotgun_MG X2WeaponTemplate]
[Shotgun_MG X2WeaponTemplate]
FriendlyName="Shard Gun"
FriendlyNamePlural="Shard Guns"
BriefSummary="Magnetic weapons technology will let us synthesize alien alloy fragments into a spray-style projectile, and our soldiers can use it to dramatic effect: the closer the better."
TacticalText="<Bullet/> Magnetized weapon technology makes for an especially effective improvement of XCOM's combat shotgun.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Shard Gun's tactical effectiveness."
AbilityDescName="shotgun"

[XComGame.RangerSword X2WeaponTemplate]
[RangerSword X2WeaponTemplate]
FriendlyName="Sword"
FriendlyNamePlural="Swords"
BriefSummary="Some of our soldiers train in the use of edged weapons, enabling them to take out enemies in close combat."
TacticalText="<Bullet/> Sword-equipped soldiers can attack adjacent enemies even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."

[XComGame.Sword_CV X2WeaponTemplate]
[Sword_CV X2WeaponTemplate]
FriendlyName="Sword"
FriendlyNamePlural="Swords"
BriefSummary="Some of our soldiers train in the use of edged weapons, enabling them to take out enemies in close combat."
TacticalText="<Bullet/> Sword-equipped soldiers can attack adjacent enemies even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="sword"

[XComGame.Sword_BM X2WeaponTemplate]
[Sword_BM X2WeaponTemplate]
FriendlyName="Fusion Blade"
FriendlyNamePlural="Fusion Blades"
BriefSummary="The Fusion Blade encases a plasma-heated metallic core in a micro-thin magnetic field, enabling devastating melee attacks that are capable of setting enemies aflame."
TacticalText="<Bullet/> This is the most advanced version of the sword, dealing maximum damage with a chance to burn enemy targets."
AbilityDescName="sword"

[XComGame.Cannon_MG X2WeaponTemplate]
[Cannon_MG X2WeaponTemplate]
FriendlyName="Mag Cannon"
FriendlyNamePlural="Mag Cannons"
BriefSummary="Magnetic weapons tech will let us deploy a rapid-fire version of the cannon. Our soldiers will be able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Mag Cannon is a much more powerful, yet equally deployable, version of the conventional Cannon.\n<Bullet/> Use upgrades looted from enemies to improve the Mag Cannon's tactical effectiveness."
AbilityDescName="cannon"

[XComGame.Cannon_BM X2WeaponTemplate]
[Cannon_BM X2WeaponTemplate]
FriendlyName="Beam Cannon"
FriendlyNamePlural="Beam Cannons"
BriefSummary="Devising a more powerful, high-volume beam weapon for our soldiers required substantial effort, but the firepower it brings is unquestioned."
TacticalText="<Bullet/> The Beam Cannon is the most powerful combat support weapon human forces can deploy.\n<Bullet/> Use upgrades looted from enemies to improve the Beam Cannon's tactical effectiveness.<br/><Bullet/> Plasma weapons also cause targets to take 1 additional damage on future hits."
AbilityDescName="cannon"

[XComGame.Pistol_CV X2WeaponTemplate]
[Pistol_CV X2WeaponTemplate]
FriendlyName="Pistol"
FriendlyNamePlural="Pistols"
BriefSummary="Some XCOM soldiers carry high-caliber pistols in addition to their primary weapons. With the proper training, these soldiers can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained soldier.\n<Bullet/> Pistols can be fired with a single action.\n<Bullet/> Some classes can train several abilities that dramatically enhance their use of pistols."

[XComGame.Pistol_MG X2WeaponTemplate]
[Pistol_MG X2WeaponTemplate]
FriendlyName="Mag Pistol"
FriendlyNamePlural="Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Pistols can be fired with a single action."

[XComeGame.Pistol_BM X2WeaponTemplate]
[Pistol_BM X2WeaponTemplate]
FriendlyName="Beam Pistol"
FriendlyNamePlural="Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Pistols can be fired with a single action."

[XComGame.AutopsyArchon X2TechTemplate]
[AutopsyArchon X2TechTemplate]
DisplayName="Archon Autopsy"
Summary="An aesthetically impressive specimen, the hidden horrors of melding organic tissue with the inner workings of a machine are well-disguised here. The unique melee weapon employed by the creature could be of particular interest."
CodeName="Balseraph"
LongDescription="Brief eyewitness accounts, including one from our own Central Officer Bradford indicate that the aliens once fielded a similar biomechatronic organism during the earliest days of the invasion. Those reports however, describe a much more gruesome and rudimentary creature versus the subject we encounter in the present day. The modern specimen could almost be described as elegant in appearance; an authoritative, intimidating figure with the advanced weaponry to match. R. Tygan."
AlertString="Archon"

[XComGame.AutopsyAdventStunLancer X2TechTemplate]
[AutopsyAdventStunLancer X2TechTemplate]
DisplayName="ADVENT Stun Lancer Autopsy"
Summary="The ADVENT Stun Lancer is commonly seen maintaining order and quelling disturbances throughout the world. Their unique stun lance could be adapted into a weapon our soldiers are already training to use."
CodeName="Chaplain"
LongDescription="On both the physical and genetic level, the ADVENT Stun Lancers are nearly identical to the Troopers our forces regularly see in combat. However, a minor yet crucial adjustment to the muscle fiber density of the Lancer improves both agility and overall survivability. Equipped with non-lethal weapons capable of easily disabling human targets, these Lancers were first deployed during the earliest days following ADVENT's establishment of the city centers, when civil unrest was a more common problem than outright resistance. In studying their usage and deployment, this raised an interesting question - if the Lancers were among the first ADVENT forces deployed, and their survivability is somewhat higher than that of the standard Trooper - did the aliens consciously reduce the Trooper's strength based on their assessment of human combat readiness? This would imply a system of rapid genetic modification beyond what I had previously imagined the aliens were capable of. It would also demonstrate a degree of \"genetic frugality\" that I would have previously assumed was irrelevant to the aliens, based on the variety of unusual experiments they've conducted. R. Tygan."
AlertString="ADVENT Stun Lancer"

[XComGame.XGLocalizedData]
[XGLocalizedData]
GameplayTips_Tactical[1]="When controlling a soldier equipped with a sword, right click on an enemy to initiate your charging melee attack."
GameplayTips_Tactical[10]="Soldiers with the Phantom ability will begin every mission in concealment, even if the squad does not."

[XComGame.HuntersInstinctUnlock X2SoldierAbilityUnlockTemplate]
[HuntersInstinctUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Ranger (Base-game class only): Hunter's Instinct"
Summary="Attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."

[XComGame.HitWhereItHurtsUnlock X2SoldierAbilityUnlockTemplate]
[HitWhereItHurtsUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Sharpshooter (Base-game class only): Deadshot"
Summary="Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies."

[XComGame.CoolUnderPressureUnlock X2SoldierAbilityUnlockTemplate]
[CoolUnderPressureUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Specialist (Base-game class only): Cool Under Pressure"
Summary="Gain +10 Aim and the ability to critically hit when taking overwatch and reaction shots."

[XComGame.BiggestBoomsUnlock X2SoldierAbilityUnlockTemplate]
[BiggestBoomsUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Grenadier (Base-game class only): Biggest Booms"
Summary="Explosives can inflict critical damage."

[HuntersInstinct X2AbilityTemplate]
LocFriendlyName="Hunter's Instincts"
LocLongDescription="Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."
LocHelpText="Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."
LocFlyOverText="Hunter's Instincts"
LocPromotionPopupText="<Bullet/> Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."

[HitWhereItHurts X2AbilityTemplate]
LocFriendlyName="Deadshot"
LocLongDescription="Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies."
LocHelpText="Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies."
LocFlyOverText="Deadshot"
LocPromotionPopupText="<Bullet/> Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies.<br/>"

[CoolUnderPressure X2AbilityTemplate]
LocFriendlyName="Cool Under Pressure"
LocLongDescription="You gain +<Ability:COOLUNDERPRESSUREBONUS/> Aim on Overwatch and other reaction shots, and they can critically hit."
LocHelpText="Bonus aim and chance to crit on Overwatch and reaction shots."
LocFlyOverText="Cool Under Pressure"
LocPromotionPopupText="<Bullet/> You gain +<Ability:COOLUNDERPRESSUREBONUS/> Aim on Overwatch and other reaction shots, and they can critically hit.<br/>

[BiggestBooms X2AbilityTemplate]
LocFriendlyName="Biggest Booms"
LocLongDescription="Your explosive attacks can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage)."
LocHelpText="Your explosives can inflict critical damage."
LocFlyOverText="Biggest Booms"
LocPromotionPopupText="<Bullet/> Your explosive attacks can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage).<br/>"

[RapidFire X2AbilityTemplate]
LocFriendlyName="Rapid Fire"
LocLongDescription="Fire twice in a row at an enemy. Each shot suffers an Aim penalty of <Ability:RAPIDFIREPENALTY/>. Can be used once per turn."
LocHelpText="Fire twice in a row at an enemy. Each shot suffers an Aim penalty of <Ability:RAPIDFIREPENALTY/>."
LocFlyOverText="Rapid Fire"
LocPromotionPopupText="<Bullet/> Rapid Fire has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"

[RapidFireSnapShot X2AbilityTemplate]
LocFriendlyName="Rapid Fire (Snap Shot)"
LocLongDescription="Fire twice in a row at an enemy. Each shot suffers an Aim penalty of <Ability:RAPIDFIREPENALTY/>. Can be used once per turn."
LocHelpText="Fire twice in a row at an enemy. Each shot suffers an Aim penalty of <Ability:RAPIDFIREPENALTY/>."
LocFlyOverText="Rapid Fire"
LocPromotionPopupText="<Bullet/> Rapid Fire has a <Ability:SelfCooldown_LW/> turn cooldown.<br/>"

[RapidFireSnapShot2 X2AbilityTemplate]
LocFriendlyName="Rapid Fire"
LocFlyOverText="Rapid Fire"

; New Class loc

[PsiOperative X2SoldierClassTemplate]
RankNames[8]="Master"
ShortNames[8]="Mstr."
RankIcons[8]= "UILibrary_LW_PerkPack.psirank_Master"

; plot type loc since sewer and subway can be combined now.

[XComGame.X2MPData_Shell]
arrMPMapFriendlyNames[9]="Underground"
arrMPMapFriendlyNames[10]="Underground"
